LucyS-CE/ECE298-Lab/STM32_Workspace/Water_Reservoir_System/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_Button_Pin GPIO_PIN_13
#define USER_Button_GPIO_Port GPIOC
#define Servo_Motor_Pin GPIO_PIN_0
#define Servo_Motor_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define DC_Motor_CH1_Pin GPIO_PIN_6
#define DC_Motor_CH1_GPIO_Port GPIOA
#define DC_Motor_CH3_Pin GPIO_PIN_0
#define DC_Motor_CH3_GPIO_Port GPIOB
#define RPM_TICK_Pin GPIO_PIN_2
#define RPM_TICK_GPIO_Port GPIOB
#define RPM_TICK_EXTI_IRQn EXTI2_IRQn
#define DIGIT_A3_Pin GPIO_PIN_10
#define DIGIT_A3_GPIO_Port GPIOB
#define DIGIT_B0_Pin GPIO_PIN_9
#define DIGIT_B0_GPIO_Port GPIOC
#define LED_Blue_Pin GPIO_PIN_8
#define LED_Blue_GPIO_Port GPIOA
#define US100_TRIG_Pin GPIO_PIN_9
#define US100_TRIG_GPIO_Port GPIOA
#define US100_ECHO_Pin GPIO_PIN_10
#define US100_ECHO_GPIO_Port GPIOA
#define LED_Green_Pin GPIO_PIN_11
#define LED_Green_GPIO_Port GPIOA
#define LED_Red_Pin GPIO_PIN_12
#define LED_Red_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define DIGIT_B1_Pin GPIO_PIN_10
#define DIGIT_B1_GPIO_Port GPIOC
#define DIGIT_B2_Pin GPIO_PIN_11
#define DIGIT_B2_GPIO_Port GPIOC
#define DIGIT_B3_Pin GPIO_PIN_12
#define DIGIT_B3_GPIO_Port GPIOC
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define DIGIT_A0_Pin GPIO_PIN_5
#define DIGIT_A0_GPIO_Port GPIOB
#define DIGIT_A1_Pin GPIO_PIN_8
#define DIGIT_A1_GPIO_Port GPIOB
#define DIGIT_A2_Pin GPIO_PIN_9
#define DIGIT_A2_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
